Repository: anaTsitsagi/CareerOnSpot
Catalog: Resources/Pages/Index.*.resx
Languages: ka, ru

# HeroTitle
source: Next Step In Your Career
ka: გააცოცხლე შენი ხედვა
ru: Раскрывая Ваше видение

# HeroSubtitle
source: We can help you find the best option to improve
ka: ტექნოლოგიური გადაწყვეტილებები ბიზნესის ზრდისთვის
ru: Технологичные решения для масштабирования вашего бизнеса

# ExploreServicesButton
source: Explore Our Services
ka: ჩვენი სერვისები
ru: наши услуги

# OurServicesHeading
source: WORK WITH US
ka: ჩვენი სერვისები
ru: Наши услуги

# Service1_Title
source: IT Strategy
ka: IT სტრატეგია
ru: ИТ-стратегия

# Service1_Description
source: > In‑depth understanding of your business needs > alignment to budget > Detailed plan of architecture, tools, and processes
ka: თქვენი ბიზნესის მოთხოვნების ღრმა გააზრება, ბიუჯეტთან შესაბამისობაში
ru: Глубокое понимание потребностей вашего бизнеса с учётом бюджета

# Service1_BackText
source: We’ll define and compare multiple tailored IT strategies so you can choose the best fit.
ka: ჩვენ შევქმნით და შევადარებთ რამდენიმე პერსონალიზებულ IT სტრატეგიას, რათა აირჩიოთ ყველაზე მომგებიანი.
ru: Мы определим и сравним несколько индивидуальных ИТ-стратегий, чтобы вы могли выбрать оптимальную.

# Service2_Title
source: Solution Design
ka: პროდუქტის დიზაინი
ru: Проектирование решений

# Service2_Description
source: > You bring a clear business idea and strategy > We analyze modules, write technical specs > Build a delivery pipeline, define all tasks > Share plans via Jira, Trello, or Azure DevOps
ka: ვაანალიზებთ მოდულებს, ვწერთ ტექნიკურ სპეციფიკაციებს, ვქმნით მიწოდების არხს, ვაზუსტებთ ყველა ამოცანას და ვადგენთ გეგმებს Jira, Trello ან Azure DevOps-ზე.
ru: мы анализируем модули, пишем технические спецификации, строим конвейер поставки, определяем все задачи и делимся планами через Jira, Trello или Azure DevOps.

# Service2_BackText
source: From modules to milestones—get a complete, transparent plan ready for development.
ka: დაგეგმარება — მიიღეთ სრული, გამჭვირვალე გეგმა განვითარებისთვის.
ru: От модулей до этапов — получите полный, прозрачный план, готовый к разработке.

# Service3_Title
source: Software Development
ka: პროგრამული უზრუნველყოფა
ru: Разработка ПО

# Service3_Description
source: > Desktop applications > scalable backend services > Mobile apps > Integrate existing software > Cloud services > AI integration
ka: დესკტოპ-აპლიკაციების შექმნა, მასშტაბირებადი backend-სერვისები, თანამედროვე ვებ-მულტიპლატფორმული აპლიკაცია, არსებულ სერვისებთან ინტეგრაცია, CLOUD დანერგვა, AIს დანერგვა.
ru: Создание настольных приложений, масштабируемых backend-сервисов,мобильных приложений, интеграция существующего, внедрение облачных сервисов.

# Service3_BackText
source: Full‑stack, end‑to‑end development tailored to your needs, with seamless integration & scaling.
ka: სრული Full-stack, End-to-End განვითარება, მორგებული თქვენს საჭიროებებზე, ინტეგრაციით და მასშტაბირებით.
ru: Полнофункциональная разработка, адаптированная под ваши нужды, с бесшовной интеграцией и масштабированием.

# Service4_Title
source: Support & Future Plan
ka: მხარდაჭერა და დაგეგმარება
ru: Поддержка и планы на будущее

# Service4_Description
source: > Ongoing support for all delivered apps > four levels of service > on‑demand solution reviews > updated designs with implementation roadmaps
ka: დასაბუთებული მხარდაჭერა ყველა დასრულებულ აპლიკაციებზე, მომსახურების ოთხი დონე, მოთხოვნის გადახედვა და განახლებული დიზაინი იმპლემენტაციის დაგეგმარება.
ru: Непрерывная поддержка всех приложений, четыре уровня обслуживания, обзоры решений по запросу и обновлённые дизайны с дорожными картами внедрения.

# Service4_BackText
source: Keep your systems running smoothly and evolve with confidence using our flexible support tiers.
ka: შეინარჩუნეთ სისტემების სტაბილურობა და განვითარდით თავდაჯერებით ჩვენი მოქნილი მხარდაჭერის დონეებით.
ru: Обеспечьте бесперебойную работу систем и развитие с уверенностью, используя наши гибкие уровни поддержки.

# AboutSection_Title
source: WHO WE ARE
ka: Logyx.tech შესახებ
ru: О Logyx.tech

# AboutParagraph1
source: At Logyx.tech, we measure our success by yours. We’re passionate about building long-term relationships, sharing knowledge, and empowering your team with transparent communication and hands-on training. Let us help you navigate today’s complex technology landscape—and turn your next big idea into a competitive advantage. Our client-first approach means we start by listening: understanding your customers, processes, and KPIs. We then architect flexible platforms that grow with you—whether it’s a mission-critical enterprise system, a public-facing web portal, or an automated data pipeline in the cloud. By embracing continuous integration, automated testing, and DevOps from day one, we accelerate time-to-market and reduce risk, so you can focus on driving innovation rather than firefighting infrastructure.
ka: Logyx.tech-ში ჩვენ ვქმნით თქვენს ხედვას რეალობად. მრავალწლიანი გამოცდილებით IT სტრატეგიათა, გადაწყვეტილებების დიზაინისა და End-to-End განვითარების სფეროში, ჩვენი გუნდი ქმნის მორგებულ პროგრამულ გადაწყვეტილებებს, რომელიც ადვილად მასშტაბირდება.
ru: В Logyx.tech мы увлечены превращением ваших идей в реальность. Благодаря многолетнему опыту в ИТ-стратегии, проектировании решений и полном цикле разработки, наша команда создаёт индивидуальные решения, которые легко масштабируются.

# AboutParagraph2
source: At Logyx.tech, our partnership truly begins long before a single line of code is written. It starts with an in-depth discovery workshop, where we dive into your business goals, user needs, and technical constraints—ensuring we capture every nuance of your vision. From there, we move into collaborative planning and prototyping, running rapid design sprints to validate concepts, refine user journeys, and create interactive mockups that bring ideas to life. Once the plan is locked down, our cross-functional teams spring into action: developers, QA engineers, and DevOps specialists work hand-in-hand in agile iterations, continuously integrating feedback, automating tests, and deploying incremental releases so you see value from day one. We don’t just ship a product and walk away—our dedicated support squad monitors performance, troubleshoots issues, and helps you adopt new features smoothly. Looking ahead, we partner on your roadmap: evaluating emerging technologies, optimizing your architecture for scale and cost-efficiency, and planning feature rollouts that keep you ahead of the curve. At every stage—from initial brainstorming through launch, support, and beyond—Logyx.tech brings clarity to complexity and innovation to every project, ensuring you have both the technical expertise and strategic guidance to succeed today and tomorrow.
ka: პირველი იდეის სრულყოფაში მოყვანიდან გრძელვადიან მხარდაჭერამდე და მომავლის დაგეგმვამდე — ჩვენ აქ ვართ თქვენთან ერთად, მკვეთრი ხედვით სირთულეში და ინოვაციით ყოველი პროექტში.
ru: От первоначального мозгового штурма до долгосрочной поддержки и планирования будущего — мы с вами на каждом этапе, привнося ясность в сложность и инновации в каждый проект.

# GetInTouchButton
source: Get in Touch
ka: დაგვიკავშირდით
ru: Связаться с нами

# OurTeamHeading
source: Our Team
ka: ჩვენი გუნდი
ru: Наша команда

# TeamMember1_Name
source: Alice Smith
ka: ალისი სმითი
ru: Элис Смит

# TeamMember1_Description
source: Lead Developer with 10+ years of experience crafting scalable .NET and Blazor applications.
ka: წევნობრივი დეველოპერი 10+ წლიანი გამოცდილებით .NET და Blazor აპლიკაციების მასშტაბირებაში.
ru: Ведущий разработчик с более чем 10-летним опытом создания масштабируемых приложений на .NET и Blazor.

# TeamMember2_Name
source: Bob Johnson
ka: ბობ ჯონსონი
ru: Боб Джонсон

# TeamMember2_Description
source: Project Manager who keeps everything on track, coordinating between stakeholders and dev teams.
ka: პროექტის მენეჯერი, რომელიც კოორდინირებას უწევს დაინტერესებულ მხარეებსა და გუნდებს სრულ თანმიმდევრობაში.
ru: Менеджер проектов, который держит всё под контролем, координируя работу заинтересованных сторон и команд разработчиков.

# TeamMember3_Name
source: Carol Lee
ka: ქეროლ ლი
ru: Кэрол Ли

# TeamMember3_Description
source: UX/UI Designer focused on creating intuitive and accessible interfaces that delight users.
ka: UX/UI დიზაინერი, ქმნის ინტუიციურ და ხელმისაწვდომ ინტერფეისებს, რომლებისთვისაც მომხმარებლები იხუტებენ.
ru: UX/UI-дизайнер, создающий интуитивные и доступные интерфейсы, которые радуют пользователей.

# TeamMember4_Name
source: David Kim
ka: დევიდ კიმ
ru: Дэвид Ким

# TeamMember4_Description
source: Cloud Architect and DevOps specialist, ensuring your solutions are robust and production‑ready.
ka: ღრუბლოვანი არქიტექტორი და DevOps სპეციალისტი, უზრუნველყოფს თქვენს გადაწყვეტილებებს ძლიერ და წარმოებისთვის მზა გარემოში.
ru: Облачный архитектор и DevOps-специалист, обеспечивающий надёжность и готовность ваших решений к продакшену.

# TeamMember5_Name
source: Eva García
ka: ევა გარსია
ru: Ева Гарсия

# TeamMember5_Description
source: AI/ML Engineer bringing intelligent automation and data‑driven insights into every project.
ka: AI/ML ინჟინერი, ინერგავს ინტელექტუალურ ავტომატიზაციას და მონაცემთა ანალიტიკას ყოველ პროექტში.
ru: Инженер AI/ML, внедряющий интеллектуальную автоматизацию и аналитику данных в каждый проект.

# TeamMember6_Name
source: Frank Müller
ka: ფრანკ მიულერი
ru: Фрэнк Мюллер

# TeamMember6_Description
source: Quality Assurance lead, passionate about delivering bug‑free and high‑performance software.
ka: QA გუნდის ლიდერი, ვნებიანია შეცდომების გარეშე და მაღალი შესრულების პროგრამული უზრუნველყოფის მიწოდებაზე.
ru: Руководитель QA, стремящийся к поставке безошибочного и высокопроизводительного ПО.

# ContactSection_Title
source: Contact Us
ka: დაგვიკავშირდით
ru: Свяжитесь с нами

# ThankYouMessage
source: Thanks for reaching out! We’ll be in touch soon.
ka: გმადლობთ! ჩვენ მალე დაგიკავშირდებით.
ru: Спасибо за ваше сообщение! Мы скоро свяжемся с вами.

# NameLabel
source: Name
ka: სახელი
ru: Имя

# EmailLabel
source: Email
ka: ელ.ფოსტა
ru: Электронная почта

# SubjectLabel
source: Subject
ka: თემა
ru: Тема

# MessageLabel
source: Message
ka: შეტყობინება
ru: Сообщение

# SendButton
source: Send
ka: გაგზავნა
ru: Отправить

# Validation_NameRequired
source: Name is required.
ka: სახელის შეყვანა აუცილებელია.
ru: Имя обязательно.

# Validation_EmailRequired
source: Email is required.
ka: ელ.ფოსტის შეყვანა აუცილებელია.
ru: Электронная почта обязательна.

# Validation_EmailInvalid
source: Invalid email address.
ka: ელ.ფოსტის მისამართი მცდარია.
ru: Неверный адрес электронной почты.

# Validation_MessageRequired
source: Please enter a message.
ka: გთხოვთ, შეიყვანოთ შეტყობინება.
ru: Пожалуйста, введите сообщение.
