Repository: anaTsitsagi/CareerOnSpot
Catalog: Resources/Pages/SoftwareDevelopment.*.resx
Languages: ka, ru

# BackButtonText
source: ← Back
ka: ← უკან
ru: ← Назад

# PageTitle
source: E2E Solution Development
ka: E2E გადაწყვეტების განვითარება
ru: E2E разработка решений

# WebDev_Title
source: Web Development
ka: ვებ განვითარება
ru: Веб-разработка

# WebDev_Point1
source: Responsive UI with modern CSS frameworks (Tailwind, Bootstrap)
ka: რეაგირებადი UI თანამედროვე CSS ჩარჩოებით (Tailwind, Bootstrap)
ru: Адаптивный интерфейс с современными CSS-фреймворками (Tailwind, Bootstrap)

# WebDev_Point2
source: Single-page apps using Blazor or React for fluid UX
ka: ერთგვერდიანი აპები Blazor ან React-ით გლუვი UX-ისთვის
ru: Одностраничные приложения на Blazor или React для плавного UX

# WebDev_Point3
source: SEO-friendly markup and performance optimization
ka: SEO-ისთვის ოპტიმიზირებული მარკაპი და შესრულების გამოკურება
ru: SEO-ориентированная разметка и оптимизация производительности

# WebDev_Point4
source: Headless CMS & e-commerce platform integrations
ka: Headless CMS და ელექტრონული კომერციის პლატფორმების ინტეგრაცია
ru: Интеграция с headless CMS и платформами электронной коммерции

# Integration_Title
source: Integration Development
ka: ინტეგრაციის განვითარება
ru: Разработка интеграций

# Integration_Point1
source: Design and consume RESTful & GraphQL APIs
ka: RESTful და GraphQL API-ების დიზაინი და გამოყენება
ru: Проектирование и потребление RESTful и GraphQL API

# Integration_Point2
source: Secure OAuth2/JWT authentication flows
ka: უსაფრთხო OAuth2/JWT ავთენტიფიკაციის ნაკადები
ru: Безопасные потоки аутентификации OAuth2/JWT

# Integration_Point3
source: Middleware connectors for legacy systems
ka: Legacy სისტემებისთვის განკუთვნილი შუამავლური კონექტორები
ru: Промежуточные коннекторы для устаревших систем

# Integration_Point4
source: Event-driven data pipelines and webhooks
ka: მოვლენაზე ორიენტირებული მონაცემთა ნაკადები და ვებქუქები
ru: Событийно-ориентированные каналы данных и вебхуки

# AIML_Title
source: AI & Machine Learning
ka: ხელოვნური ინტელექტი და მანქანური სწავლება
ru: ИИ и машинное обучение

# AIML_Point1
source: Data cleaning, feature engineering & model training
ka: მონაცემების გასუფთავება, თვისებების ინჟინერია და მოდელების გაწვევა
ru: Очистка данных, подготовка признаков и обучение моделей

# AIML_Point2
source: NLP solutions: chatbots & sentiment analysis
ka: NLP გადაწყვეტები: ჩატ-ბოტები და ტონს ანალიზი
ru: Решения NLP: чат-боты, анализ тональности

# AIML_Point3
source: Computer Vision: image classification & object detection
ka: კომპიუტერული ხედვა: გამოსახულების კლასიფიკაცია და ობიექტების გამოვლენა
ru: Компьютерное зрение: классификация изображений и обнаружение объектов

# AIML_Point4
source: Model deployment (TensorFlow, ONNX) & monitoring
ka: მოდელების განთავსება (TensorFlow, ONNX) და მონიტორინგი
ru: Развертывание моделей (TensorFlow, ONNX) и мониторинг

# Cloud_Title
source: Cloud Services
ka: ღრუბლოვანი სერვისები
ru: Облачные сервисы

# Cloud_Point1
source: Infrastructure as Code (Terraform, ARM templates)
ka: ინფრასტრუქტურა როგორც კოდი (Terraform, ARM შაბლონები)
ru: Инфраструктура как код (Terraform, ARM-шаблоны)

# Cloud_Point2
source: Container orchestration with Docker & Kubernetes
ka: Docker და Kubernetes-ით კონტეინერების ორკესტრაცია
ru: Оркестрация контейнеров с Docker и Kubernetes

# Cloud_Point3
source: Auto-scaling, high-availability architecture
ka: ავტომასშტაბირება და მაღალი ხელმისაწვდომობის არქიტექტურა
ru: Автомасштабирование и отказоустойчивая архитектура

# Cloud_Point4
source: CI/CD pipelines (GitHub Actions, Azure DevOps)
ka: CI/CD გზავნილები (GitHub Actions, Azure DevOps)
ru: CI/CD-конвейеры (GitHub Actions, Azure DevOps)

# Backend_Title
source: Backend Services
ka: ბექენდ სერვისები
ru: Бэкенд-сервисы

# Backend_Point1
source: Microservices using .NET/C# with DDD patterns
ka: მიკროსერვისები .NET/C#-ში DDD პატერნებით
ru: Микросервисы на .NET/C# с паттернами DDD

# Backend_Point2
source: Scalable REST & gRPC APIs
ka: მომატებული REST და gRPC API-ები
ru: Масштабируемые REST и gRPC API

# Backend_Point3
source: Relational & NoSQL database design
ka: რელაციური და NoSQL მონაცემთა ბაზების დიზაინი
ru: Проектирование реляционных и NoSQL баз данных

# Backend_Point4
source: Logging, health checks & observability
ka: ლოგინგი, კონტროლი და მონიტორინგი
ru: Логирование, health-checks и наблюдаемость

# Mobile_Title
source: Mobile Development
ka: მობილური განვითარება
ru: Мобильная разработка

# Mobile_Point1
source: Cross-platform apps with .NET MAUI or React Native
ka: Cross-platform აპები .NET MAUI-თ ან React Native-თ
ru: Кроссплатформенные приложения на .NET MAUI или React Native

# Mobile_Point2
source: Native feature integration: GPS, camera, push notifications
ka: ნატიური ფუნქციების ინტეგრაცია: GPS, კამერა, push შეტყობინებები
ru: Интеграция нативных функций: GPS, камера, push-уведомления

# Mobile_Point3
source: Offline data sync and local storage strategies
ka: ოფლაინ მონაცემთა სინქრონიზაცია და ადგილობრივი შენახვის სტრატეგიები
ru: Синхронизация офлайн-данных и стратегии локального хранения

# Mobile_Point4
source: App Store & Play Store packaging & deployment
ka: App Store და Play Store-ში გამოქვეყნების პროცესი
ru: Публикация в App Store и Play Store

# Desktop_Title
source: Desktop App Development
ka: დესკტოპ აპლიკაციების განვითარება
ru: Разработка настольных приложений

# Desktop_Point1
source: Electron, .NET MAUI, WPF or WinForms solutions
ka: Electron, .NET MAUI, WPF ან WinForms გადაწყვეტილებები
ru: Решения на Electron, .NET MAUI, WPF или WinForms

# Desktop_Point2
source: Cross-platform installers and auto-updaters
ka: Cross-platform დამონტაჟებლები და ავტო განახლება
ru: Кроссплатформенные установщики и автообновления

# Desktop_Point3
source: Modern UI/UX with adaptive layouts
ka: თანმიმდევრული UI/UX ადაპტიური განლაგებით
ru: Современный UI/UX с адаптивной вёрсткой

# Desktop_Point4
source: Integration with local hardware & services
ka: სამუშაო აპარატურასა და სერვისებთან ინტეგრაცია
ru: Интеграция с локальным оборудованием и сервисами
