Repository: anaTsitsagi/CareerOnSpot
Catalog: Resources/Pages/SolutionDesign.*.resx
Languages: ka, ru

# BackButtonText
source: ← Back
ka: ← უკან
ru: ← Назад

# PageTitle
source: Solution Design
ka: გადაწყვეტილების დიზაინი
ru: Проектирование решений

# Step1_Title
source: You come to us with your business idea and IT-strategy insights.
ka: თქვენ გვეპყრობით თქვენი ბიზნეს-იდეითა და IT სტრატეგიით.
ru: Вы приходите к нам со своей бизнес-идеей и ИТ-стратегией.

# Step1_Point1
source: Review your high-level strategy to align technical scope with business goals
ka: თქვენი მაღალი დონის სტრატეგიის მიმოხილვა, რომ ტექნიკური მოცულობა შეესაბამებოდეს ბიზნეს მიზნებს
ru: Анализ вашей общей стратегии для соответствия технического объема бизнес-целям

# Step1_Point2
source: Gather existing documentation, user personas, and success metrics
ka: არსებული დოკუმენტაციის, მომხმარებლის პერсонаების და წარმატების მეტრიკების შეგროვება
ru: Сбор существующей документации, портретов пользователей и метрик успеха

# Step1_Point3
source: Host a kickoff workshop with stakeholders to clarify assumptions
ka: სტეიკჰოლდერებთან შეხვედრის სანაწყიო სემინარის ორგანიზება ანდასრულებების გასარკვევად
ru: Проведение вводного семинара со стейкхолдерами для уточнения предположений

# Step1_Point4
source: Define project constraints: budget, timeline, compliance requirements
ka: პროექტის შეზღუდვების განსაზღვრა: ბიუჯეტი, ვადები, რეგულაციური მოთხოვნები
ru: Определение ограничений проекта: бюджет, сроки, требования к соответствию

# Step2_Title
source: We analyze every module and write a technical description.
ka: ჩვენ ვაანალიზებთ თითოეულ მოდულს და ვწერთ ტექნიკურ აღწერას.
ru: Мы анализируем каждый модуль и создаем техническое описание.

# Step2_Point1
source: Break down the solution into functional domains and microservices
ka: შესყიდვის ფუნქციური დომენებისა და მიკროსერვისების დაშლა
ru: Разбиение решения на функциональные области и микросервисы

# Step2_Point2
source: Draft data models, API contracts, and user-flow diagrams
ka: მონაცემთა მოდელების, API კონტრაქტებისა და მომხმარებლის ნაკადების დიაგრამების მომზადება
ru: Создание моделей данных, контрактов API и диаграмм пользовательских потоков

# Step2_Point3
source: Specify tech stack choices (frontend, backend, database, messaging)
ka: ტექნოლოგიური სტეკის შერჩევა (ფრონტენდი, ბექენდი, მონაცემთა ბაზა, მესიჯინგი)
ru: Указание выбора стека технологий (frontend, backend, БД, обмен сообщениями)

# Step2_Point4
source: Document non-functional requirements: performance, security, scalability
ka: არაინტერკუთხოვნების დოკუმენტაცია: შესრულება, უსაფრთხოება, მასშტაბურობა
ru: Документирование нефункциональных требований: производительность, безопасность, масштабируемость

# Step3_Title
source: We create a delivery pipeline.
ka: ჩვენ ვქმნით მიწოდების არხს.
ru: Мы создаем конвейер поставки.

# Step3_Point1
source: Design CI/CD workflows for build, test, and deployment stages
ka: CI/CD სამუშაო პროცესების დიზაინი შენაგებისა, ტესტებისა და განლაგების ეტაპებისთვის
ru: Проектирование CI/CD процессов для этапов сборки, тестирования и развертывания

# Step3_Point2
source: Integrate static code analysis, unit testing, and security scans
ka: სტატიკური კოდის ანალიზის, ერთეულიანი ტესტებისა და უსაფრთხოების სკანირების ინტეგრაცია
ru: Интеграция статического анализа кода, модульных тестов и проверок безопасности

# Step3_Point3
source: Configure artifact repositories and container registries
ka: არტეფაქტების საცავებისა და კონტეინერების რეესტრების კონფიგურაცია
ru: Настройка хранилищ артефактов и реестров контейнеров

# Step3_Point4
source: Set up automated rollback and monitoring hooks
ka: ავტომატური როლბექისა და მონიტორინგის ხელსაწყოების დასაყენებლად
ru: Настройка автоматического отката и инструментов мониторинга

# Step4_Title
source: We define every single task needed for the final result.
ka: ჩვენ ვზომავთ ყველა დავალებას საბოლოო შედეგისთვის.
ru: Мы определяем каждую задачу, необходимую для конечного результата.

# Step4_Point1
source: Translate technical specs into actionable user stories or tasks
ka: ტექნიკური სპეციფიკაციების გარდაქმნა მომხმარებლის ისტორიებად ან დავალებებად
ru: Преобразование технических спецификаций в пользовательские истории или задачи

# Step4_Point2
source: Estimate effort and assign priority (MoSCoW / story points)
ka: შრომის დროის შეფასება და პრიორიტეტის განსაზღვრა (MoSCoW / story points)
ru: Оценка усилий и назначение приоритетов (MoSCoW / story points)

# Step4_Point3
source: Organize tasks into sprints or milestones
ka: დავალებების ორგანიზება სპრინტებად ან ეტაპებად
ru: Организация задач по спринтам или этапам

# Step4_Point4
source: Prepare acceptance criteria and test scenarios for each item
ka: მიამზადეთ მიღების კრიტერიუმები და ტესტის სცენარები თითოეულ დავალებაზე
ru: Подготовка критериев приемки и тестовых сценариев для каждой задачи

# Step5_Title
source: We hand off all designs in your tool of choice (Jira, Trello, Azure DevOps, etc.).
ka: ჩვენ გადავცემთ ყველა დიზაინს თქვენს არჩეულ ინსტრუმენტში (Jira, Trello, Azure DevOps და ა.შ.).
ru: Мы передаем все дизайны в инструмент вашего выбора (Jira, Trello, Azure DevOps и др.).

# Step5_Point1
source: Populate boards with epics, stories, and sub-tasks
ka: ეპიკების, ისტორიებისა და ქვედავალებების დაფების შევსება
ru: Заполнение досок эпиками, историями и подзадачами

# Step5_Point2
source: Attach wireframes, sequence diagrams, and API spec docs
ka: Wireframe-ების, სეკვენს დიაგრამებისა და API სპეციფიკაციების დოკუმენტების მიმაგრება
ru: Прикрепление wireframe, последовательных диаграмм и спецификаций API

# Step5_Point3
source: Configure workflows, labels, swimlanes, and permission schemes
ka: სამუშაო პროცესების, ეტიკეტების, swimlane-ებისა და ნებართვების სქემების კონფიგურაცია
ru: Настройка рабочих процессов, меток, swimlanes и схем разрешений

# Step5_Point4
source: Ensure handoff includes a walkthrough and knowledge-transfer session
ka: გადაცემის პროცესში walkthrough-ის და ცოდნის გადაცემის სესიების ჩართვა
ru: Обеспечение walkthrough и сессии передачи знаний
