Repository: anaTsitsagi/CareerOnSpot
Catalog: Resources/Pages/Support.*.resx
Languages: ka, ru

# BackButtonText
source: ← Back
ka: ← უკან
ru: ← Назад

# PageTitle
source: Support & Future Plan
ka: მხარდაჭერა და სამომავლო გეგმა
ru: Поддержка и планы на будущее

# Step1_Title
source: Continuous support for our applications is available.
ka: ხელმისაწვდომია ჩვენი აპლიკაციების უწყვეტი მხარდაჭერა.
ru: Доступна непрерывная поддержка наших приложений.

# Step1_Description
source: We offer ongoing maintenance, bug fixes, and feature updates to keep your software running smoothly.
ka: ჩვენ გთავაზობთ მუდმივ ტექნიკურ მომსახურებას, ბაგების გამოსწორებას და ფუნქციების განახლებას, რათა თქვენი პროგრამა შეუფერხებლად იმუშაოს.
ru: Мы предлагаем постоянное обслуживание, исправление ошибок и обновление функций для бесперебойной работы вашего ПО.

# Step2_Title
source: Choose from 4 different levels of support.
ka: არჩევა 4 სხვადასხვა მხარდაჭერის დონეს შორის.
ru: Выберите один из 4 уровней поддержки.

# Step2_Description
source: Select the plan that fits your needs—from basic monitoring to full-time dedicated support.
ka: აირჩიეთ გეგმა — ძირითადი მონიტორინგიდან სრული დროის გამოყოფილი მხარდაჭერამდე.
ru: От базового мониторинга до круглосуточной выделенной поддержки — выберите подходящий план.

# Step3_Title
source: Request a solution review at any time.
ka: მოთხოვეთ გადაწყვეტილების გადახედვა ნებისმიერ დროს.
ru: Запросите обзор решения в любое время.

# Step3_Description
source: Have us reassess your application against the latest standards and best practices whenever you need.
ka: ჩვენ შევაფასებთ თქვენს აპლიკაციას უახლესი სტანდარტებისა და საუკეთესო პრაქტიკის შესაბამისად.
ru: Переоцените ваше приложение в соответствии с последними стандартами и лучшими практиками, когда потребуется.

# Step4_Title
source: Receive updated designs and roadmaps.
ka: მიიღეთ განახლებული დიზაინები და გზამკვლევები.
ru: Получите обновлённые дизайны и дорожные карты.

# Step4_Description
source: If changes are needed, we’ll deliver new designs along with a clear implementation plan.
ka: თუ საჭირო იქნება ცვლილებები, მოგაწვდით ახალ დიზაინებს და განხორციელების მკაფიო გეგმას.
ru: При необходимости изменений мы предоставим новые дизайны и чёткий план внедрения.
